IRP/src/Documents/MoneyTransfer/MoneyTransfer.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>MoneyTransfer</name>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R3011T_CashFlow</registerRecords>
 <registerRecords>AccumulationRegister.R3021B_CashInTransitIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R3035T_CashPlanning</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R3010B_CashOnHand</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Receiver</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveUUID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </attributes>
 <attributes>
  <name>SendAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>SendCurrency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </attributes>
 <attributes>
  <name>Sender</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>SendUUID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </attributes>
 <attributes>
  <name>SendFinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>SendCashFlowCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveFinancialMovementType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveCashFlowCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>CashTransferOrder</name>
  <type>
   <types>DocumentRef.CashTransferOrder</types>
  </type>
 </attributes>
 <attributes>
  <name>ConsolidatedRetailSales</name>
  <type>
   <types>DocumentRef.ConsolidatedRetailSales</types>
  </type>
 </attributes>
 <attributes>
  <name>Workstation</name>
  <type>
   <types>CatalogRef.Workstations</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveBranch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>TransitAccount</name>
  <type>
   <types>CatalogRef.CashAccounts</types>
  </type>
 </attributes>
 <attributes>
  <name>TransitUUID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </attributes>
 <attributes>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>LossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>RevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>ProfitCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </attributes>
 <attributes>
  <name>SendLocalTotalAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>SendLocalRate</name>
  <type>
   <types>DefinedType.typeCurrencyRate</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveLocalTotalAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </attributes>
 <attributes>
  <name>ReceiveLocalRate</name>
  <type>
   <types>DefinedType.typeCurrencyRate</types>
  </type>
 </attributes>
 <tabularSections>
  <name>Currencies</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>CurrencyFrom</name>
   <type>
    <types>CatalogRef.Currencies</types>
   </type>
  </attributes>
  <attributes>
   <name>Rate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ReverseRate</name>
   <type>
    <types>DefinedType.typeCurrencyRate</types>
   </type>
  </attributes>
  <attributes>
   <name>ShowReverseRate</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
  <attributes>
   <name>Multiplicity</name>
   <type>
    <types>Number</types>
    <numberQualifiers>
     <precision>10</precision>
    </numberQualifiers>
   </type>
  </attributes>
  <attributes>
   <name>MovementType</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
   </type>
  </attributes>
  <attributes>
   <name>Amount</name>
   <type>
    <types>DefinedType.typeAmount</types>
   </type>
  </attributes>
  <attributes>
   <name>IsFixed</name>
   <type>
    <types>Boolean</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/Enums/CashAccountTypes/CashAccountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashAccountTypes</name>
 <enumValues>
  <name>Bank</name>
 </enumValues>
 <enumValues>
  <name>Cash</name>
 </enumValues>
 <enumValues>
  <name>Transit</name>
 </enumValues>
 <enumValues>
  <name>POS</name>
 </enumValues>
 <enumValues>
  <name>POSCashAccount</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/CashFlowDirections/CashFlowDirections.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>CashFlowDirections</name>
 <enumValues>
  <name>Incoming</name>
 </enumValues>
 <enumValues>
  <name>Outgoing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Documents/MoneyTransfer/ManagerModule.bsl
#Region PRINT_FORM

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region POSTING

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);

	Tables.R3010B_CashOnHand.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.R3035T_CashPlanning.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.R3021B_CashInTransitIncoming.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
	Tables.R3011T_CashFlow.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);

	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region UNDOPOSTING

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	QueryArray.Add(MoneySender());
	QueryArray.Add(MoneyReceiver());
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(R3010B_CashOnHand());
	QueryArray.Add(R3011T_CashFlow());
	QueryArray.Add(R3021B_CashInTransitIncoming());
	QueryArray.Add(R3035T_CashPlanning());
	Return QueryArray;
EndFunction

#EndRegion

#Region Posting_SourceTable

Function MoneySender()
	Return "SELECT
		   |	MoneyTransfer.Ref,
		   |	MoneyTransfer.Company AS Company,
		   |	MoneyTransfer.Ref.Branch AS Branch,
		   |	MoneyTransfer.Ref AS Ref,
		   |	MoneyTransfer.Sender AS Account,
		   |	MoneyTransfer.Sender AS AccountFrom,
		   |	MoneyTransfer.Receiver AS AccountTo,
		   |	MoneyTransfer.SendAmount AS Amount,
		   |	MoneyTransfer.SendCurrency AS Currency,
		   |	MoneyTransfer.SendUUID AS Key,
		   |	MoneyTransfer.Date AS Period,
		   |	MoneyTransfer.CashTransferOrder AS BasisDocument,
		   |	MoneyTransfer.CashTransferOrder.SendPeriod AS PlanningPeriod,
		   |	MoneyTransfer.SendFinancialMovementType AS FinancialMovementType,
		   |	MoneyTransfer.SendCashFlowCenter AS CashFlowCenter,
		   |	MoneyTransfer.Sender.Type = VALUE(Enum.CashAccountTypes.POSCashAccount) AS IsPOSCashAccount
		   |INTO MoneySender
		   |FROM
		   |	Document.MoneyTransfer AS MoneyTransfer
		   |WHERE
		   |	MoneyTransfer.Ref = &Ref";
EndFunction

Function MoneyReceiver()
	Return "SELECT
		   |	MoneyTransfer.Ref,
		   |	MoneyTransfer.Company AS Company,
		   |	MoneyTransfer.Ref.ReceiveBranch AS Branch,
		   |	MoneyTransfer.Ref.ReceiveBranch AS ReceiveBranch,
		   |	MoneyTransfer.Ref AS Ref,
		   |	MoneyTransfer.Receiver AS Account,
		   |	MoneyTransfer.Sender AS AccountFrom,
		   |	MoneyTransfer.Receiver AS AccountTo,
		   |	MoneyTransfer.ReceiveAmount AS Amount,
		   |	MoneyTransfer.ReceiveCurrency AS Currency,
		   |	MoneyTransfer.ReceiveUUID AS Key,
		   |	MoneyTransfer.Date AS Period,
		   |	MoneyTransfer.CashTransferOrder AS BasisDocument,
		   |	MoneyTransfer.CashTransferOrder.SendPeriod AS PlanningPeriod,
		   |	MoneyTransfer.ReceiveFinancialMovementType AS FinancialMovementType,
		   |	MoneyTransfer.ReceiveCashFlowCenter AS CashFlowCenter,
		   |	MoneyTransfer.Receiver.Type = VALUE(Enum.CashAccountTypes.POSCashAccount) AS IsPOSCashAccount,
		   |
		   |	MoneyTransfer.Receiver.Type = VALUE(Enum.CashAccountTypes.POSCashAccount)
		   |	OR MoneyTransfer.Sender.Type = VALUE(Enum.CashAccountTypes.POSCashAccount) AS UseCashInTransit
		   |INTO MoneyReceiver
		   |FROM
		   |	Document.MoneyTransfer AS MoneyTransfer
		   |WHERE
		   |	MoneyTransfer.Ref = &Ref";
EndFunction

#EndRegion

#Region Posting_MainTables

Function R3021B_CashInTransitIncoming()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	MoneyReceiver.Period,
		   |	MoneyReceiver.Company,
		   |	MoneyReceiver.ReceiveBranch AS Branch,
		   |	MoneyReceiver.Ref AS Basis,
		   |	MoneyReceiver.AccountTo AS Account,
		   |	MoneyReceiver.Amount,
		   |	MoneyReceiver.Currency,
		   |	MoneyReceiver.Key
		   |INTO R3021B_CashInTransitIncoming
		   |FROM
		   |	MoneyReceiver AS MoneyReceiver
		   |WHERE
		   |	MoneyReceiver.IsPOSCashAccount
		   |
		   |UNION ALL
		   |
		   |SELECT
		   |	VALUE(AccumulationRecordType.Receipt) AS RecordType,
		   |	MoneySender.Period,
		   |	MoneySender.Company,
		   |	MoneySender.Branch,
		   |	MoneySender.Ref AS Basis,
		   |	MoneySender.AccountTo AS Account,
		   |	MoneySender.Amount,
		   |	MoneySender.Currency,
		   |	MoneySender.Key
		   |FROM
		   |	MoneySender AS MoneySender
		   |WHERE
		   |	MoneySender.IsPOSCashAccount";
EndFunction

Function R3010B_CashOnHand()
	Return "SELECT
		   |	VALUE(AccumulationRecordType.Expense) AS RecordType,
		   |	MoneySender.Period,
		   |	MoneySender.Company,
		   |	MoneySender.Branch,
		   |	MoneySender.Account,
		   |	MoneySender.Amount,
		   |	MoneySender.Currency,
		   |	MoneySender.Key
		   |INTO R3010B_CashOnHand
		   |FROM
		   |	MoneySender AS MoneySender
		   |
		   |UNION ALL
		   |
		   |SELECT
		   |	VALUE(AccumulationRecordType.Receipt),
		   |	MoneyReceiver.Period,
		   |	MoneyReceiver.Company,
		   |	MoneyReceiver.Branch,
		   |	MoneyReceiver.Account,
		   |	MoneyReceiver.Amount,
		   |	MoneyReceiver.Currency,
		   |	MoneyReceiver.Key
		   |FROM
		   |	MoneyReceiver AS MoneyReceiver
		   |WHERE
		   |	NOT MoneyReceiver.UseCashInTransit";
EndFunction

Function R3011T_CashFlow()
	Return "SELECT
		   |	MoneySender.Period,
		   |	MoneySender.Company,
		   |	MoneySender.Branch,
		   |	MoneySender.Account,
		   |	VALUE(Enum.CashFlowDirections.Outgoing) AS Direction,
		   |	MoneySender.FinancialMovementType,
		   |	MoneySender.CashFlowCenter,
		   |	MoneySender.Amount,
		   |	MoneySender.Currency,
		   |	MoneySender.Key
		   |INTO R3011T_CashFlow
		   |FROM
		   |	MoneySender AS MoneySender
		   |
		   |UNION ALL
		   |
		   |SELECT
		   |	MoneyReceiver.Period,
		   |	MoneyReceiver.Company,
		   |	MoneyReceiver.Branch,
		   |	MoneyReceiver.Account,
		   |	VALUE(Enum.CashFlowDirections.Incoming),
		   |	MoneyReceiver.FinancialMovementType,
		   |	MoneyReceiver.CashFlowCenter,
		   |	MoneyReceiver.Amount,
		   |	MoneyReceiver.Currency,
		   |	MoneyReceiver.Key
		   |FROM
		   |	MoneyReceiver AS MoneyReceiver
		   |WHERE
		   |	NOT MoneyReceiver.UseCashInTransit";
EndFunction

Function R3035T_CashPlanning()
	Return "SELECT
		   |	MoneySender.Period,
		   |	MoneySender.Company,
		   |	MoneySender.Branch,
		   |	MoneySender.BasisDocument,
		   |	MoneySender.PlanningPeriod,
		   |	MoneySender.Account,
		   |	MoneySender.Currency,
		   |	VALUE(Enum.CashFlowDirections.Outgoing) AS CashFlowDirection,
		   |	MoneySender.FinancialMovementType,
		   |	-MoneySender.Amount AS Amount,
		   |	MoneySender.Key
		   |INTO R3035T_CashPlanning
		   |FROM
		   |	MoneySender AS MoneySender
		   |WHERE
		   |	NOT MoneySender.BasisDocument.Ref IS NULL
		   |
		   |UNION ALL
		   |
		   |SELECT
		   |	MoneyReceiver.Period,
		   |	MoneyReceiver.Company,
		   |	MoneyReceiver.Branch,
		   |	MoneyReceiver.BasisDocument,
		   |	MoneyReceiver.PlanningPeriod,
		   |	MoneyReceiver.Account,
		   |	MoneyReceiver.Currency,
		   |	VALUE(Enum.CashFlowDirections.Incoming),
		   |	MoneyReceiver.FinancialMovementType,
		   |	-MoneyReceiver.Amount,
		   |	MoneyReceiver.Key
		   |FROM
		   |	MoneyReceiver AS MoneyReceiver
		   |WHERE
		   |	NOT MoneyReceiver.BasisDocument.Ref IS NULL";
EndFunction

#EndRegion

#Region AccessObject

// Get access key.
// 
// Parameters:
//  Obj - DocumentObjectDocumentName -
// 
// Returns:
//  Map
Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	BranchArray = New Array;
	BranchArray.Add(Obj.Branch);
	BranchArray.Add(Obj.ReceiveBranch);
	AccessKeyMap.Insert("Branch", BranchArray);
	
	AccountArray = New Array;
	AccountArray.Add(Obj.Receiver);
	AccountArray.Add(Obj.Sender);
	AccessKeyMap.Insert("Account", AccountArray);
	Return AccessKeyMap;
EndFunction

#EndRegion
